使用`pandas`进行数据的输入和输出
- 读取文本文件
- 硬盘上的其他高效地格式文件
- 从数据库中载入数据
- 与网络资源交互

## 文本格式数据的读写

将**表格型数据读取为DataFrame对象**时Pandas的重要特性

函数 | 说明
- | -
read_csv | 从文件，URL或文件型对象读取**分隔好的数据，逗号是默认分隔符**
read_table | 从文件，URL或文件型对象读取**分隔好的数据，制表符`\t`是默认分隔符**
read_fwf |从**特定宽度格式的文件**中读取数据
read_clipboard | `read_table`的**剪贴板版本**， 在将表格从web页面上转换成数据时有用
read_excel | **从Excel的XLS或XLSX文件中读取表格数据**
read_hdf | 读取用pandas存储的HDF5文件
read_html | 从HTML文件中读取所有表格数据
read_json | 从json字符串中读取数据
read_msgpack |  读取MessagePack二进制格式的pandas数据
read_pcikle | 读取以Python pickle 格式存储的任意对象
read_sas |读取存储在SAS 系统中定制存储格式的SAS数据集
read_sql | 将SQL查询读取为DataFrame
read_stata | 读取Stata格式的数据集
read_feather | 读取Feather二进制 格式

函数的可选参数
- 索引
    - 可以将一或多个列作为返回的DataFrame，从文件或用户处获得列名， 或者没有列名
- 类型推断和数据转换
    - 包括用户自定义的值转换和自定义的缺失值列表
- 日期时间解析
    - 包括组合功能
    - 将分散在多个列上的日期和时间信息组合长结果中的单个列
- 迭代
    - 支持对大型文件的分块迭代
- 未清洗数据问题
    - 跳过行，页脚，注释等其他次要数据

In [2]:
import pandas as pd
from pandas import Series, DataFrame # 最常用的类

In [3]:
import matplotlib.pyplot as plt
import numpy as np
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True) # numpy 不要使用科学计数法，小数4位

In [4]:
!cat pydata-book/examples/ex1.csv

9,10,11,12,foo

In [5]:
df = pd.read_csv('pydata-book/examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
df = pd.read_table('pydata-book/examples/ex1.csv')
df

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

In [7]:
df = pd.read_table('pydata-book/examples/ex1.csv', sep=',')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
df = pd.read_table('pydata-book/examples/ex2.csv', sep=',')
df

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [9]:
!cat pydata-book/examples/ex2.csv

9,10,11,12,foo

In [10]:
pd.read_csv('pydata-book/examples/ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [11]:
pd.read_csv('pydata-book/examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [19]:
pd.read_csv('pydata-book/examples/ex2.csv',names=['a', 'b', 'c', 'd', 'message'], index_col='message' )

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [20]:
!cat pydata-book/examples/csv_mindex.csv

In [21]:
pd.read_csv('pydata-book/examples/csv_mindex.csv')

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [23]:
pd.read_csv('pydata-book/examples/csv_mindex.csv', index_col=['key1', 'key2'])

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [24]:
pd.read_csv('pydata-book/examples/csv_mindex.csv', index_col=['key2', 'key1'])

           value1  value2
key2 key1
a    one        1       2
b    one        3       4
c    one        5       6
d    one        7       8
a    two        9      10
b    two       11      12
c    two       13      14
d    two       15      16

In [25]:
!cat pydata-book/examples/ex3.csv

ddd -0.871858 -0.348382  1.100491

In [26]:
!cat pydata-book/examples/ex3.txt

In [28]:
list(open('pydata-book/examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [31]:
pd.read_table('pydata-book/examples/ex3.txt', sep='\s+')

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [33]:
!cat  pydata-book/examples/ex4.csv

9,10,11,12,foo

In [34]:
pd.read_csv('pydata-book/examples/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [35]:
!cat  pydata-book/examples/ex5.csv

three,9,10,11,12,foo

In [36]:
pd.read_csv('pydata-book/examples/ex5.csv')

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [37]:
pd.read_csv('pydata-book/examples/ex5.csv').isnull()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [38]:
pd.read_csv('pydata-book/examples/ex5.csv', na_values=['10'])

  something  a    b     c   d message
0       one  1  2.0   3.0   4     NaN
1       two  5  6.0   NaN   8   world
2     three  9  NaN  11.0  12     foo

In [40]:
pd.read_csv('pydata-book/examples/ex5.csv', na_values={ 'a': [1,4], 'b':[2] })

  something    a     b     c   d message
0       one  NaN   NaN   3.0   4     NaN
1       two  5.0   6.0   NaN   8   world
2     three  9.0  10.0  11.0  12     foo

### 分块读入文本文件

当处理大型文件或找出正确的参数集来正确**处理大文件**时。你**可能需要读入文件的一个小片段或者按小块遍历文件**

In [41]:
pd.options.display.max_rows = 10

In [42]:
pd.read_csv('pydata-book/examples/ex6.csv')

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [43]:
pd.read_csv('pydata-book/examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [77]:
chunker = pd.read_csv('pydata-book/examples/ex6.csv', chunksize=100)
chunker

In [79]:
tot = Series([], dtype=float)

In [80]:
for price in chunker:
    tot = tot.add( price['key'].value_counts(), fill_value=0 )

In [87]:
tot = tot.sort_values(ascending=False)

In [88]:
tot[:10]

E    368.0
X    364.0
L    345.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [52]:
tot

Series([], dtype: float64)

### 将数据写入文本格式

In [90]:
!cat  pydata-book/examples/ex5.csv

three,9,10,11,12,foo

In [92]:
data = pd.read_csv('pydata-book/examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [93]:
data.to_csv('pydata-book/examples/out.csv')

In [95]:
data.to_csv('pydata-book/examples/out1.csv', index=False, na_rep='NULL')

In [96]:
import sys

In [97]:
data.to_csv(sys.stdout, index=False, na_rep='NULL')

something,a,b,c,d,message
one,1,2,3.0,4,NULL
two,5,6,NULL,8,world
three,9,10,11.0,12,foo

In [98]:
data.to_csv(sys.stdout, index=False, na_rep='NULL', columns=['b', 'c', 'a'])

b,c,a
2,3.0,1
6,NULL,5
10,11.0,9

In [101]:
data = pd.date_range(' 13/11/2020', periods=7)
ts = Series(np.arange(7), index=data)
ts

2020-11-13    0
2020-11-14    1
2020-11-15    2
2020-11-16    3
2020-11-17    4
2020-11-18    5
2020-11-19    6
Freq: D, dtype: int64

In [104]:
ts.to_csv(sys.stdout)

,0
2020-11-13,0
2020-11-14,1
2020-11-15,2
2020-11-16,3
2020-11-17,4
2020-11-18,5
2020-11-19,6

### 使用分隔格式

绝大多数表格数据都可以使用函数`read_table`从硬盘中读取，然而，**在某些情况下，一些手动操作可能是必不可少的**

接受一个带有一行或多行错误的文件并不少见，`read_table`也无法解决此类问题，需要一些工具的介入

In [105]:
!cat pydata-book/examples/ex7.csv

In [106]:
pd.read_csv('pydata-book/examples/ex7.csv')

   a  b  c
0  1  2  3
1  1  2  3

In [108]:
pd.read_table('pydata-book/examples/ex7.csv', header=None)

           0
0  a,"b","c"
1  1,"2","3"
2  1,"2","3"

In [110]:
import csv

In [111]:
f = open('pydata-book/examples/ex7.csv')

In [112]:
reader = csv.reader(f)

In [113]:
reader

In [114]:
for line in reader: print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [115]:
with   open('pydata-book/examples/ex7.csv') as f:
    lines = list(csv.reader(f))
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [117]:
headers, values = lines[0], lines[1:]

In [118]:
headers

['a', 'b', 'c']

In [120]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [122]:
data_dict = { h:v for h, v in zip(headers,zip(*values) ) }
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [124]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [126]:
reader = csv.reader( open('pydata-book/examples/ex7.csv'), dialect=my_dialect)

In [127]:
list(reader)

[['a,"b","c"'], ['1,"2","3"'], ['1,"2","3"']]

In [131]:
with open('pydata-book/examples/mydata.csv', 'w')  as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))        
    writer.writerow(('7', '8', '9'))

In [132]:
reader = csv.reader( open('pydata-book/examples/mydata.csv'), dialect=my_dialect)
list(reader)

[['one', 'two', 'three'], ['1', '2', '3'], ['4', '5', '6'], ['7', '8', '9']]

In [133]:
f.close()

### JSON数据

`Json`已经成为了Web浏览器和其他应用键通过HTTP请求发送数据的标准格式，它是一种比CSV等表格文本形式更自由的数据形式

`Json`非常接近Python代码， 除了Null值和一些其他的细微差别（不允许列表末尾的逗号）之外，基本类型是对象，数组，字符串，数字等

`Pandas`中的`read_json`可以自动将JSON数据集按照指定的次序转换为Series或DataFrame

`read_json`的默认选项是假设`JSON`**数组中的每一个对象是表里的一行**

In [134]:
!cat pydata-book/examples/example.json

In [135]:
pd.read_json('pydata-book/examples/example.json')

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [136]:
data = pd.read_json('pydata-book/examples/example.json')

In [137]:
data.to_json()

'{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}'

In [138]:
data.to_json(orient='records')

'[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]'

### XML和HTML 网络抓取

`read_html`可以使用`lxml`和`Beautiful Soup4`等库**将HTML中的表格自动解析为DataFrame**, 默认情况下，会搜索并尝试解析所有包含`<table>`标签中的表格型数据， **返回的是DataFrame对象的列表**

In [139]:
tables = pd.read_html('pydata-book/examples/fdic_failed_bank_list.html')
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [140]:
len(tables)

1

In [141]:
tables[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
...,...,...,...,...,...,...,...
542,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
543,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
544,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
545,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
546,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [142]:
close_timestamps = pd.to_datetime(tables[0]['Closing Date'])

In [143]:
close_timestamps

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [146]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

#### 使用lxml.objectify解析xml

In [147]:
from lxml import objectify

In [148]:
path = 'pydata-book/datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
parsed

In [149]:
root= parsed.getroot()
root

In [150]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES']

In [151]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue 
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [153]:
pref = DataFrame(data)
pref

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95,96,95,95
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95,96.3,95,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95,96.8,95,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95,96.6,95,95.8
...,...,...,...,...,...,...,...,...,...,...,...,...
643,Metro-North Railroad,Escalator Availability,Percent of the time that escalators are operat...,2011,8,Service Indicators,M,%,97,,97,
644,Metro-North Railroad,Escalator Availability,Percent of the time that escalators are operat...,2011,9,Service Indicators,M,%,97,,97,
645,Metro-North Railroad,Escalator Availability,Percent of the time that escalators are operat...,2011,10,Service Indicators,M,%,97,,97,
646,Metro-North Railroad,Escalator Availability,Percent of the time that escalators are operat...,2011,11,Service Indicators,M,%,97,,97,
647,Metro-North Railroad,Escalator Availability,Percent of the time that escalators are operat...,2011,12,Service Indicators,M,%,97,,97,

## 二进制格式

**使用Python内建的`pickle`序列化模块进行二进制格式操作是存储数据最高效，最方便的方式之一**

`pandas`对象拥有一个`to_pickle`方法，可以将数据以`pickle`格式写入硬盘，使用内建的`pickle`读取文件中"pcikle化"的对象，或者更方便的使用`read_pickle`做上述操作

In [154]:
frame = pd.read_csv('pydata-book/examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [155]:
frame.to_pickle('pydata-book/examples/frame_pickle')

In [156]:
pd.read_pickle('pydata-book/examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### 使用HDF5格式

`HDF5`是一种备受好评的文件格式，用于**存储大量的科学数组数据**， 以C库的形式提供，并且具有许多其他语言的接口，包括Java，Julia，Matlab和Python

`HDF5`中的`HDF`代表**分层数据格式**。每个`HDF`文件可以**存储多个数据集并且支持元数据**，且**支持多种压缩模式的即时压缩**，使得重复模式的数据可以更高效的存储

`HDF5`适合用于处理不适合在内存中存储的超大数据，可以使你高效读写大型数据的一部分

`HDF5` **并不是数据库，是一种适合一次写入多次读取的数据集**，尽管数据可以在任何时间添加到文件中，但是如果多个写入着持续写入，文件可能损害

Python可以通过`PyTabs`和`h5py`等库直接访问HDF5文件，但是 **Pnadas提供了一个高效的接口，简化Series 和 DataFrame的存储**

`HDFStore`类**像字典一样工作**并处理低级别细节
- `HDFStore`**支持两种存储模式** `fixed`和`table`，第二种速度更慢，但是支持一种特殊语法(类sql)的查询操作
- `put`是`[]`添加数据的**显示版本**，可以设置其他选项
- `read_hdf`

In [157]:
frame = DataFrame( {'a': np.random.randn(100)})
frame

           a
0  -0.204708
1   0.478943
2  -0.519439
3  -0.555730
4   1.965781
..       ...
95  0.795253
96  0.118110
97 -0.748532
98  0.584970
99  0.152677

[100 rows x 1 columns]

In [158]:
frame.a

0    -0.204708
1     0.478943
2    -0.519439
3    -0.555730
4     1.965781
        ...
95    0.795253
96    0.118110
97   -0.748532
98    0.584970
99    0.152677
Name: a, Length: 100, dtype: float64

In [161]:
store = pd.HDFStore('pydata-book/examples/mydata.h5')

In [162]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: pydata-book/examples/mydata.h5

In [163]:
store['obj1'] = frame

In [168]:
store['obj1_col'] =frame.a

In [169]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: pydata-book/examples/mydata.h5

In [170]:
store['obj1']

           a
0  -0.204708
1   0.478943
2  -0.519439
3  -0.555730
4   1.965781
..       ...
95  0.795253
96  0.118110
97 -0.748532
98  0.584970
99  0.152677

[100 rows x 1 columns]

In [171]:
store['obj1_col']

0    -0.204708
1     0.478943
2    -0.519439
3    -0.555730
4     1.965781
        ...
95    0.795253
96    0.118110
97   -0.748532
98    0.584970
99    0.152677
Name: a, Length: 100, dtype: float64

In [172]:
store['obj1_co2']

KeyError: 'No object named obj1_co2 in the file'

In [175]:
print(store.info())

<class 'pandas.io.pytables.HDFStore'>
File path: pydata-book/examples/mydata.h5
/obj1                frame        (shape->[100,1])
/obj1_col            series       (shape->[100])

In [176]:
store.put('obj2', frame, format='table')

In [178]:
store.select('obj2', where=['index >=10 and index <=15'])

           a
10  1.007189
11 -1.296221
12  0.274992
13  0.228913
14  1.352917
15  0.886429

In [179]:
store.close()

In [180]:
pd.read_hdf('pydata-book/examples/mydata.h5', 'obj2', where=['index<=5'])

          a
0 -0.204708
1  0.478943
2 -0.519439
3 -0.555730
4  1.965781
5  1.393406

### 读取Microsoft Excel文件

**`pandas`也支持通过`ExcelFile`类或`pandas.read_excel`函数来读取存储在Excel2003或更高版本的表格型数据**

这些工具内部是使用`xlrd`和`openpyxl`分别读取`XLS`或`XLSX`文件的

`ExcelFile`作为中间类，read_Excel从中读取更快

写入Excel时，必须先生成一个`ExcelWriter`,之后使用`to_excel`更快捷

In [182]:
xlsx = pd.ExcelFile()
xlsx

In [184]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [186]:
frame = pd.read_excel('pydata-book/examples/ex1.xlsx', 'Sheet1') ## 更简洁
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [187]:
writer = pd.ExcelWriter('pydata-book/examples/ex2.xlsx')

In [188]:
frame.to_excel(writer, 'Sheet1')

In [189]:
writer.close()

In [190]:
frame.to_excel('pydata-book/examples/ex3.xlsx', 'Sheet1')

### 与WebAPI 交互

很多网站都是公开的API， 通过JSON或其他数据格式提供数据服务

有许多方式可以利用Python来访问API

In [191]:
import requests

In [192]:
url ='https://api.github.com/repos/pandas-dev/pandas/issues'

In [193]:
resp = requests.get(url)

In [194]:
resp

In [195]:
data = resp.json()

In [196]:
len(data)

30

In [197]:
data[0]

{'url': 'https://api.github.com/repos/pandas-dev/pandas/issues/37812',
 'repository_url': 'https://api.github.com/repos/pandas-dev/pandas',
 'labels_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/37812/labels{/name}',
 'comments_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/37812/comments',
 'events_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/37812/events',
 'html_url': 'https://github.com/pandas-dev/pandas/pull/37812',
 'id': 742418394,
 'node_id': 'MDExOlB1bGxSZXF1ZXN0NTIwNTU1MzM1',
 'number': 37812,
 'title': 'CI: The `set-env` and `add-path` commands are deprecated and will be disabled on November 16th.',
 'user': {'login': 'simonjayhawkins',
  'id': 13159005,
  'node_id': 'MDQ6VXNlcjEzMTU5MDA1',
  'avatar_url': 'https://avatars0.githubusercontent.com/u/13159005?v=4',
  'gravatar_id': '',
  'url': 'https://api.github.com/users/simonjayhawkins',
  'html_url': 'https://github.com/simonjayhawkins',
  'followers_url': 'https://api.github.com/users/simonjayhawkins/followers',
  'following_url': 'https://api.github.com/users/simonjayhawkins/following{/other_user}',
  'gists_url': 'https://api.github.com/users/simonjayhawkins/gists{/gist_id}',
  'starred_url': 'https://api.github.com/users/simonjayhawkins/starred{/owner}{/repo}',
  'subscriptions_url': 'https://api.github.com/users/simonjayhawkins/subscriptions',
  'organizations_url': 'https://api.github.com/users/simonjayhawkins/orgs',
  'repos_url': 'https://api.github.com/users/simonjayhawkins/repos',
  'events_url': 'https://api.github.com/users/simonjayhawkins/events{/privacy}',
  'received_events_url': 'https://api.github.com/users/simonjayhawkins/received_events',
  'type': 'User',
  'site_admin': False},
 'labels': [{'id': 48070600,
   'node_id': 'MDU6TGFiZWw0ODA3MDYwMA==',
   'url': 'https://api.github.com/repos/pandas-dev/pandas/labels/CI',
   'name': 'CI',
   'color': 'a2bca7',
   'default': False,
   'description': 'Related to Continuous Integration'}],
 'state': 'open',
 'locked': False,
 'assignee': None,
 'assignees': [],
 'milestone': None,
 'comments': 0,
 'created_at': '2020-11-13T12:34:36Z',
 'updated_at': '2020-11-13T12:37:01Z',
 'closed_at': None,
 'author_association': 'MEMBER',
 'active_lock_reason': None,
 'pull_request': {'url': 'https://api.github.com/repos/pandas-dev/pandas/pulls/37812',
  'html_url': 'https://github.com/pandas-dev/pandas/pull/37812',
  'diff_url': 'https://github.com/pandas-dev/pandas/pull/37812.diff',
  'patch_url': 'https://github.com/pandas-dev/pandas/pull/37812.patch'},
 'body': 'https://github.com/pandas-dev/pandas/actions/runs/361523610',
 'performed_via_github_app': None}

In [201]:
issues = DataFrame(data, columns=['number', 'title', 'labels', 'state'])

In [202]:
issues

,number,title,labels,state
0,37812,CI: The `set-env` and `add-path` commands are ...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
1,37811,BUG: rowLabels and colLabels args in pandas.pl...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
2,37808,DOC: capitalize Python as proper noun,[],open
3,37807,CLN: remove (presumed) unused clause in _isna ...,[],open
4,37805,ENH: Add 'end' option in resample's origin,[],open
...,...,...,...,...
25,37770,[BUG]: Isin converted floats unnecessarily to ...,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
26,37768,"BUG: downsampling with last doesn't accept ""m...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,37765,CI: migrate from travis-ci.org to travis-ci.com,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
28,37764,Bug in loc did not raise KeyError when missing...,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
29,37763,BUG: DataFrame.at setter of categorical DF ove...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

### 与数据库交互

In [212]:
import sqlite3
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('pydata-book/examples/mydata.sqlite')
con.execute(query)
con.commit()

In [213]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [214]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [215]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [219]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///pydata-book/examples/mydata.sqlite')
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5